{
  "projects": [
    {
      "name": "Wolface",
      "subtitle": "Partagez vos meilleurs moments avec vos amis, votre famille et plus encore sur Wolface.",
      "logo": "/assets/images/projects/logo/wolface-logo.webp",
      "banner": "/assets/images/projects/gallery/wolface-1.webp",
      "galleryImage": [
        "/assets/images/projects/gallery/wolface-2.webp",
        "/assets/images/projects/gallery/wolface-3.webp",
        "/assets/images/projects/gallery/wolface-4.webp",
        "/assets/images/projects/gallery/wolface-5.webp"
      ],
      "date": "2022",
      "description": "Wolface est un projet étudiant visant à recréer l'expérience d'un réseau social complet, similaire à Facebook, en mettant l'accent sur l'interaction utilisateur. L'objectif principal était d'explorer et de maîtriser les concepts fondamentaux du développement web en concevant une plateforme dynamique où les utilisateurs peuvent partager leurs meilleurs moments, interagir avec leur communauté et tisser des liens avec leurs proches.\rEntièrement développé en PHP et basé sur une base de données MySQL, Wolface intègre toutes les fonctionnalités essentielles d'un réseau social moderne. Les utilisateurs peuvent s'inscrire et se connecter en toute sécurité, publier du contenu, aimer, commenter et partager des publications, et ajouter des amis pour développer leur réseau personnel. Un fil d'actualité personnalisé affiche les dernières publications de leurs amis, permettant une interaction fluide et immersive.\rCe projet a été réalisé en collaboration avec un graphiste, responsable du design et de l'ergonomie du site, tandis que je me suis occupé de l'ensemble du développement, front-end et back-end. Ce travail m'a permis de renforcer mes compétences en gestion de bases de données, manipulation de sessions utilisateur, création d'interfaces dynamiques et sécurité des données. Grâce à cette expérience, j'ai acquis une meilleure compréhension du fonctionnement des réseaux sociaux et des défis techniques liés à leur conception, tout en mettant en œuvre une architecture robuste et performante.",
      "tools": ["PHP", "MySQL"],
      "links": [
        "",
        "https://github.com/valvanh/WOLFACE",
        ""
      ]
    },
    {
      "name": "All In One",
      "subtitle": "Vous êtes créateur de contenu ? Vous avez du mal à gérer vos réseaux ? Arrêtez tout ! All In One est la solution. Gérez tous vos réseaux depuis un seul et même endroit, sans effort.",
      "logo": "/assets/images/projects/logo/all-in-one-logo.webp",
      "banner": "/assets/images/projects/gallery/all-in-one-1.webp",
      "galleryImage": [
        "/assets/images/projects/gallery/all-in-one-2.webp",
        "/assets/images/projects/gallery/all-in-one-3.webp",
        "/assets/images/projects/gallery/all-in-one-4.webp",
        "/assets/images/projects/gallery/all-in-one-5.webp"
      ],
      "date": "2024",
      "description": "All In One est une solution innovante conçue pour les créateurs de contenu souhaitant centraliser et automatiser la gestion de leurs réseaux sociaux. Dans un monde où la présence en ligne est essentielle, cette application leur permet de publier, planifier et analyser leur contenu sur plusieurs plateformes depuis un seul et même espace, optimisant ainsi leur temps et leur productivité.\rAvec All In One, les utilisateurs peuvent connecter leurs comptes YouTube, Twitter, Instagram, TikTok et bien d'autres pour gérer leurs publications de manière fluide et efficace. L'application intègre un système de règles automatisées permettant d'adapter la diffusion du contenu à chaque plateforme. Par exemple, lorsqu'une nouvelle vidéo est mise en ligne sur YouTube, une publication promotionnelle doit être créée sur Twitter et Instagram. De plus, l'outil offre un tableau de bord avancé avec des statistiques détaillées sur les performances des publications et l'engagement de l'audience, ainsi qu'un système de planification pour organiser les publications à l'avance.\rEntièrement conçu, développé et réalisé par mes soins avec AdonisJs, All In One est le fruit d'un travail approfondi combinant développement back-end et front-end, gestion des API pour les réseaux sociaux, optimisation des performances et expérience utilisateur intuitive. Ce projet m'a permis de perfectionner mes compétences en développement full-stack tout en répondant aux besoins concrets des créateurs de contenu, en leur offrant un outil puissant et flexible pour gérer efficacement leur présence en ligne.",
      "tools": ["AdonisJS"],
      "links": [
        "lien maquette",
        "lien github",
        "lien site"
      ]
    },
    {
      "name": "3D",
      "subtitle": "Mon premier site Web 3D utilisant ThreeJS",
      "logo": "/assets/images/projects/logo/3d-world-logo.webp",
      "banner": "/assets/images/projects/gallery/3d-world-1.webp",
      "galleryImage": [
        "/assets/images/projects/gallery/3d-world-2.webp",
        "/assets/images/projects/gallery/3d-world-3.webp",
        "/assets/images/projects/gallery/3d-world-4.webp",
        "/assets/images/projects/gallery/3d-world-5.webp"
      ],
      "date": "2024",
      "description": "3D est un projet expérimental qui vise à explorer le développement web interactif en combinant ReactJS et ThreeJS pour créer une expérience utilisateur 3D immersive. Conçu comme un site one-page, ce projet est avant tout une exploration du code créatif, mêlant animations fluides, transitions dynamiques et intégration d'éléments 3D pour offrir une navigation visuellement captivante.\rÀ partir d'une maquette récupérée de Figma, l'objectif était de donner vie à un design statique en intégrant des éléments tridimensionnels et en assurant une interaction fluide avec l'utilisateur. Grâce à ThreeJS, j'ai pu modéliser et animer des objets 3D, tout en utilisant ReactJS pour structurer et organiser le site de manière modulaire. Chaque détail a été travaillé pour offrir une expérience esthétique et intuitive, avec des animations fluides lors des transitions entre les sections, une gestion optimisée des performances et une interactivité naturelle avec les éléments visuels.\rCe projet a été une excellente occasion de perfectionner mes compétences en développement front-end avancé, en optimisation du rendu WebGL et en conception d'interfaces modernes et dynamiques. En repoussant les limites de la conception interactive, la 3D représente une fusion de technologie et de créativité, démontrant le potentiel des environnements Web immersifs et interactifs.",
      "tools": ["ReactJS", "ThreeJS"],
      "links": [
        "lien maquette",
        "lien github",
        "lien site"
      ]
    }
  ]
}