{
  "projects": [
    {
      "name": "Wonderin'",
      "subtitle": "Là où les écrivains écrivent, il y aura toujours des lecteurs pour les lire. Voyagez dans des mondes imaginés par des millions de personnes et partagez vos histoires avec le monde entier.",
      "logo": "/assets/images/projects/logo/wonderin-logo.webp",
      "banner": "/assets/images/projects/gallery/wonderin-1.webp",
      "galleryImage": [
        "/assets/images/projects/gallery/wonderin-2.webp",
        "/assets/images/projects/gallery/wonderin-3.webp",
        "/assets/images/projects/gallery/wonderin-4.webp",
        "/assets/images/projects/gallery/wonderin-5.webp",
        "/assets/images/projects/gallery/wonderin-6.webp"
      ],
      "date": "2022",
      "description": "Wonderin' est une plateforme dédiée aux passionnés d'écriture et de lecture, offrant un espace interactif où chacun peut partager ses histoires et découvrir celles d'autres passionnés. Inspiré du concept de Wattpad, ce projet vise à créer une véritable communauté littéraire où l'imagination de chacun prend vie à travers des histoires originales.\nL'application propose diverses fonctionnalités favorisant l'engagement des utilisateurs : publication de chapitres, suivi des auteurs favoris, commentaires et réactions sur les œuvres, ainsi qu'un système de recommandations personnalisées en fonction des préférences de lecture. Les auteurs peuvent structurer leurs écrits, illustrer leurs histoires et interagir directement avec leur public pour enrichir leur processus créatif.\rDéveloppée dans le cadre d'un projet scolaire, Wonderin' est le fruit d'une collaboration entre un graphiste et développeur front-end et moi-même, en charge du développement back-end avec Laravel. Mon travail s'est concentré sur la gestion des utilisateurs, la structuration des bases de données, la mise en place d'API, ainsi que l'optimisation des performances et de la sécurité du site. Grâce à cette expérience, j'ai pu approfondir mes compétences en développement web tout en contribuant à une plateforme conçue pour encourager la créativité et le partage au sein d'une communauté dynamique.",
      "tools": ["Laravel"],
      "links": [
        "https://www.figma.com/design/FIv10RKrYGiRvuT6akaKjk/Maquette-Wonderin-?node-id=105-2&t=MmtVNx63TIjUVzBj-1",
        "https://github.com/valvanh/Wonderin",
        ""
      ]
    },
    {
      "name": "Agrios Agriculture (en cours)",
      "subtitle": "L'avenir de l'écologie et de l'agriculture. Rejoignez l'aventure Agrios Agriculture et contribuez à une alimentation plus saine et plus éco-responsable.",
      "logo": "/assets/images/projects/logo/agrio-logo.webp",
      "banner": "/assets/images/projects/gallery/agrio-1.webp",
      "galleryImage": [
        "/assets/images/projects/gallery/agrio-2.webp",
        "/assets/images/projects/gallery/agrio-3.webp",
        "/assets/images/projects/gallery/agrio-4.webp",
        "/assets/images/projects/gallery/agrio-5.webp",
        "/assets/images/projects/gallery/agrio-6.webp",
        "/assets/images/projects/gallery/agrio-7.webp"
      ],
      "date": "2024",
      "description": "Agrios Agriculture est un site web moderne et épuré, conçu pour promouvoir une agriculture plus saine et plus éco-responsable. Ce projet vise à mettre en avant les engagements et les services de l'entreprise Agrios Agriculture, spécialisée dans les pratiques agricoles durables et innovantes.\nConformément à sa mission, le site propose une interface fluide et intuitive permettant aux visiteurs de découvrir les initiatives écologiques, les produits et services proposés, ainsi que des articles informatifs sur l'agriculture moderne.\rL'objectif principal du projet était de concevoir un site complet à partir d'un modèle récupéré sur Figma, tout en explorant un nouveau framework, AstroJS. Le site comprend plusieurs sections essentielles, dont une page d'accueil immersive, une présentation de l'entreprise, un blog dynamique propulsé par un CMS (type WordPress) et un formulaire de contact interactif facilitant les échanges avec les visiteurs et les clients potentiels.\rEn développant Agrios Agriculture, j'ai pu approfondir mes compétences en intégration de modèles, en développement web avec AstroJS, en gestion de contenu via un CMS et en optimisation des performances pour une navigation fluide et rapide. Ce projet m'a également permis de travailler sur des aspects cruciaux tels que le référencement, l'accessibilité et la compatibilité multi-appareils, garantissant ainsi une expérience utilisateur optimale sur tous les supports.",
      "tools": ["AstroJS"],
      "links": [
        "https://www.figma.com/design/5ez3VC1kj5uf6SPraf20gh/75--Agriculture-Landing-website-templates--Community-?node-id=0-1&t=MmtVNx63TIjUVzBj-1",
        "https://github.com/valvanh/agrios-astro",
        ""
      ]
    },
    {
      "name": "Geogames",
      "subtitle": "Vous pensez être un expert en jeux vidéo ? Voyons cela de plus près. Essayez de découvrir dans quel jeu vous avez atterri et où.",
      "logo": "/assets/images/projects/logo/geogames-logo.webp",
      "banner": "/assets/images/projects/gallery/geogames-1.webp",
      "galleryImage": [
        "/assets/images/projects/gallery/geogames-2.webp",
        "/assets/images/projects/gallery/geogames-3.webp",
        "/assets/images/projects/gallery/geogames-4.webp",
        "/assets/images/projects/gallery/geogames-5.webp",
        "/assets/images/projects/gallery/geogames-6.webp"
      ],
      "date": "2024",
      "description": "Geogames est un jeu web interactif inspiré du concept Redbull GeoGamer, alliant exploration, mémoire visuelle et culture vidéoludique. À mi-chemin entre GeoGuessr et un quiz vidéoludique, il invite les joueurs à plonger dans des environnements de différents jeux et à relever un double défi : identifier le titre du jeu et se situer précisément sur la carte virtuelle de ce monde.\nL'idée est née d'une frustration : ne pouvant pas jouer à la version officielle du concept, j'ai décidé de relever le défi technique et créatif de le développer moi-même. Entièrement conçu en pur JavaScript (sans framework) et ThreeJS, Geogames offre une expérience 3D immersive, permettant aux joueurs d'observer leur environnement sous tous les angles avant de faire leurs suppositions. Le jeu teste également leurs connaissances et leur sens de l'orientation à travers des niveaux variés, allant des grands classiques du jeu vidéo à des mondes moins connus.\rPour rendre l'expérience encore plus compétitive et engageante, Geogames intègre un système de score qui permet aux joueurs d'enregistrer leurs performances et d'essayer d'améliorer leur résultat à chaque nouvelle partie. Plus la réponse est précise, plus le score est élevé, encourageant ainsi les joueurs à améliorer leur observation et leur connaissance des jeux vidéo. Ce système de progression offre un véritable défi et incite à rejouer pour atteindre le meilleur score possible.\rCe projet m'a permis d'approfondir mes compétences en JavaScript natif, en manipulation de scènes 3D avec ThreeJS et en optimisation des performances pour une fluidité maximale. Il représente également une réflexion sur l'interaction utilisateur, la conception du jeu et la mise en place d'un système de validation et de notation des réponses, rendant l'expérience aussi ludique que stimulante. Geogames est ainsi l'aboutissement d'une passion pour les jeux vidéo et le développement web, alliant créativité et technicité pour offrir une expérience originale et compétitive aux joueurs.",
      "tools": ["JavaScript", "ThreeJS"],
      "links": [
        "https://www.figma.com/design/u2GsjUGVWSw5tuzFq7EWYU/%F0%9F%94%8D%F0%9F%95%B9%EF%B8%8F-GeoGames?node-id=0-1&t=MmtVNx63TIjUVzBj-1",
        "",
        "https://geogames.io/"
      ]
    }
  ]
}